Revit 2027 API
FormatValueOptions Properties
The FormatValueOptions type exposes the following members.
Properties
Name | Description
AppendUnitSymbol |  Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
FormatValueOptions Class
Autodesk.Revit.DB Namespace